#                                       why functions?



# რატომ ფუნქცია? რატომ უნდა გამოვიყენოთ ფუნქციები როცა უბრალოდ შეგვიძლია რომ კოდი დავწეროთ?



# ახალი ფუნქციის შექმნა გაძლევს შესაძლებლობას რომ ფუნქციას ეკუთვნოდეს კოდის ნაწილი, რომელიც პროგრამას ადვილად წასაკითხს გახდის და დებაგინგიც მარტივი იქნება.

# ფუნქციებს შეუძლიათ რომ პროგრამა შედარებით დააპატარაონ. ეს ხდება განმეორებადი კოდის მოშორებით. ფუქნციები გვეხმარება კოდის შემოკლებაში, და როცა მუშაობა გვიწევს დიდ კოდთან საუკეთესოა მისი გამოყენება.


# დიდი პროგრამის ფუნქციებად დაყოფა შესაძლებელს ხდის რომ კოდს ერორები მოაშორო ერთი მეორის მიყოლებით, და შემდეგ ააწყო როგორც ერთი მთლიანი.


# კარგად შესრულებული ფუნქციები ხშირად გამოსადეგია რომ ბევრი პროგრამისთვის გამოიყენო. ერთხელ დაწერ და მოაშორებ ერორებს და შემდეგ იმდენჯერ გამოიყენებ რამდენჯერაც გსურს
