#                                     adding new functions


# აქამდე ჩვენ მხოლოდ ვიყენებდით იმ ფუნქციებს რომლებიც პითონს მოყვებოდა(ასეთ ფუნქციებს ჩაშენებული ფუნქციები ეწოდებათ), მაგრამ შესაძლებელია რომ შენითვე შექმნა ახალი ფუნქცია. ფუნქციის აღწერა განსაზღვრავს ახალი ფუნქციის სახელს და ბრძანებების მიმდევრობას, რომლებიც შესრულდება მაშინ, როცა ფუნქცია გამოიძახება.

# ერთ-ერთი მაგალითი:

def print_lyrics():
    print("I'm a lumberjack, and I'm okay.")
    print("I sleep all night and I work all day.")




# def არის ქივორდი რომელიც მიანიშნებს ფუნქციის შექმნაზე. ანუ def არის ის რაც ქმნის ფუნქციას.

# ფუნქციის სახელია print_lyrics. წესები ფუნქციის სახელისთვის თითქმის იგივეა რაც წესები ცვლადებისთვის. შეგვიძლია გამოვიყენოთ რიცხვები და ქვედატირეები, მაგრამ პირველი სიმბოლო არასდროს არუნდა იყოს არც რიცხვი და არც ქვედატირე. აუცილებლად დაიმახსოვრე რომ არ შექმნა ცვლადი და ფუნქცია ერთნაირი სახელებით

# ფუნქციის სახელი არის უნიკალური იდენტიფიკატორი, რომლის მეშვეობითაც შესაძლებელია კონკრეტული ფუნქციის გამოძახება

# ფუნქციის სახელი ასევე საშვალებას გვაძლევს რომ კოდი იმდენჯერ განმეორდეს რამდენჯერაც გვსურს, ამის გასაკეთებლად უბრალოდ საჭიროა რომ დავწეროთ ფუნქციის სახელი და ფრჩხილები. 

print_lyrics()

# I'm a lumberjack, and I'm okay.
# I sleep all night and I work all day.




