#                                      parameters and arguments



# მოდი ჯერ შევქმნათ ფუნცქცია და ამის ფონზე ვისაუბროთ პარამეტრებზე და არგუმენტებზე.

def greet(name):  #name არის პარამეტრი 
    return f"hello, {name}."


print(greet("sofia"))  # "sofia" არის არგუმენტი


# მარტივად რომ მიხვდე თუ რა არის პარამეტრი წარმოიდგინე ადამიანი, რომლის დავალებაც არის რომ ყველას მიესალმოს ოღონდ მხოლოდ იმ შემთხვევაში თუ მას შენს სახელს ეტყვი. როცა ადამიანს ეტყვი შენს სახელს ის დაგიბრუნებს პასუხს -> "hello {your name}" თუ არ ეტყვი კი არ მოგესალმება და საერთოდ გაჩერდება.

# წარმოიდგინე რომ სახელი რომელსაც შენ გადასცემ ეს არის არგუმენტი

# ამ შემთხვევაში ფუნქციის პარამეტრი იგივე ცვლადის მნიშვნელობას ასრულებს, მას მნიშვნელობად მიეცემა შენგან გადაცემული არგუმენტი და შეასრულებს იმ ბრძანებას რაც ფუნქციის შიგნით გიწერია. ამ შემთხვევაში მოგესალმება

