#                                           Floor division and modulus


# floor division - რიცხვის გაყოფა რომელიც ამრგვალებს რიცხვს.


# როგორც ვიცით ჩვეულებრივი / ოპერატორის გამოყენებისას რიცხვი რჩება როგორც float მონაცემთა ტიპი მაგრამ floor division გვიბრუნებს ინტეჯერს.

# // ყოფს ორ რიცხვს და ამრგვალებს რიცხვს დაბლა. ანუ რას ვგულისხმობ

minutes = 105
print(minutes / 50) # ეს უდრის 1.75

minutes = 105
print(minutes // 50) #ეს უდრის 1

# ანუ რეალურად დაბლა დამრგვალდა floor division

# modulus operator - ნაშთის ოპერატორი რომელიც ორ რიცხვს ყოფს და აბრუნებს ნაშთს

# მაგ:
num = 10

print(num % 3) #ეს უდრის 1-ს რადგან 10 რომ 3ზე გავყოთ ნაშთი 1
 









