# ცვლადები vs ობიექტები.(ცვლადები მნიშვნელობებს არ ინახავენ, მითითებები არიან უბრალოდ)
# ანუ a = 5 და შემდეგ ხაზზე b = a - ორივე ერთსა და იმავე ობიექტზე მიუთითებს.



a = 5 
b = a

# a არის ცვლადი — უბრალოდ სახელი, რომელიც მიუთითებს ობიექტზე.
# Python ქმნის ობიექტს 5 და a მიუთითებს ამ ობიექტზე.
# როცა ვწერთ b = a, ახალი ობიექტი არ იქმნება — b უბრალოდ იღებს იმავე მისამართს, რა მისამართიც a-ს აქვს.


# ანუ a და b ერთიდაიგივე ობიექტს, ინტეჯერ 5-ს მიუთითებენ


# შეჯამება:

# ცვლადები არ ინახავენ მონაცემებს, ისინი მხოლოდ  მისამართებს ინახავენ 
# ობიექტები კი  ინახავენ რეალურ მონაცემებს მეხსიერებაში