#                                   რა არის პროგრამა



# A program is a set of instructions written in a programming language that a computer can follow to perform a specific task or solve a problem. It tells the computer what to do and how to do it.


# პროგრამა არის ის ინსტრუქციები რომელსაც კომპიუტერი ასრულებს, ეს ინსტრუქციები დაწერილია პროგრამირების ენაზე რომელსაც კომპიუტერი მიყვება და სპეციფიკურ პრობლემას ხსნის. ანუ მოკლედ პროგრამა ეუბნება კომპიუტერს რა დავალება უნდა შეასრულოს და როგორ უნდა შეასრულოს ეს დავალება. 

# პროგრამირების ენა არის ზუსტად ის რაც გვაძლევს ჩვენ საშვალებას რომ კომპიუტერს ეს ინსტრუქციები გადავცეთ.

# არსებობს ბევრი პროგრამირების ენა და ამ ენებში ბევრი დეტალი განსხვავებულია მაგრამ არსებობს ძირითადი ინსტრუქციები როგორიცაა:

# input - გვეხმარება მონაცემების აღებაში კლავიატურიდან, ფაილიდან, ქსელიდან ან რაიმე სხვა დევაისიდან

# output - მონაცემები გამოაქვს ეკრანძე, ინახავს ფაილში, ქსელში გზავნის და ა.შ

# math - ყველა პროგრამას შეუძლია ძირითადი მათემატიკური ოპერაციების შესრულება, ასეთია მიმატება და გამრავლება

# conditional execution იგივე პირობითი შესრულება - ნიშნავს რომ კოდი შესრულდება თუ შესრულდება გარკვეული წინაპირობა. მაგ: if age > 18:
                                                        # print(adult)



#                                               FIRST PROGRAM

# როდესაც იწყებ პროგრამირებას, პირველი კოდი რასაც შენ დაწერ იქნება print("hello world!"), ეს არის ერთ-ერთი ბრძანება რომელსაც პითონი ასრულებს. 

# რა არის პრინტ ბრძანება - წარმოიდგინე ჩვეულებრივი პრინტერი არის იგივე პრინტ ბრძანება. რასაც პრინტერი ბეჭდავს ფურცელზე, ეს არის ის ტექსტი რასაც პრინტ ბრძანების ფრჩხილებს შორის ვწერთ


print('Hello, World!')
# ეს არის ბეჭდვის (print) ბრძანების მაგალითი, თუმცა რეალურად ის არაფერს ბეჭდავს ქაღალდზე — უბრალოდ შედეგს აჩვენებს ეკრანზე.

# ამ შემთხვევაში შედეგია სიტყვები Hello, World!


# ფრჩხილებში მოქცეული ტექსტი არის ის რაც უნდა გამოჩნდეს ეკრანზე - ფრჩხილები შედეგში არ ჩანს


