#                             ARITHMETIC OPERATORS


# პრინტ ფუნქციის შემდეგი ნაბიჯი არის არითმეტიკული მოქმედებები. პითონს აქვს მათემატიკური ოპერატორები, ეს ოპერატორები არის სპეციალური სიმბოლოები მაგ: "+", "-", "/", "*"

# 1. addition - მიმატება

print(10 + 10)

# ტერმინალში გამოვა ამ ორი რიცხვის ჯამი, რადგან ვიყენებთ მათემატიკურ ოპერატორს "+"

# 2. substraction - სხვაობა

print(20 - 10)

# ტერმინალში გამოვა ამ ორი რიცხვოს სხვაობა რადგან ვოყენებთ ოპერატორ "-"

# 3.  multiplication - გამრავლება

print(10 * 3)

# ტერმინალში გამოვა ამ ორი რიცხვის ნამრავლი რადგან ვიყენებთ ოპერატორ "*"

# 4. division - გაყოფა

print(50 / 5)

# ტერმინალში გამოვა ამ ორი რიცხვის განაყოფი რადგან ვიყენებთ ოპერატორ "/" მაგრამ ამ რიცხვების შედეგი იქნება 10.0 და არა 10 ამას მონაცემთა ტიპების ახსნის შემდეგ გავიგებთ.

#  5. exponentiation - ხარისხში აყვანა

print( 3 ** 2)

# ეს ნიშნავს 3 ხარისხად ორი. და ტერმინალში გამოვა ამის შედეგი რადგან გამოვიყენეთ ოპერატორი "**t4 i03gu9h48"