#                      values and types

# value - მნიშვნელობა 


# "მნიშვნელობა " არის ერთ-ერთი ძირითადი რამ რითიც პროგრამა მუშაობს. ესაა მაგალითად რიცხვები ან ასოები. მნიშვნელობები რაც ჩვენ აქამდე შეგვხვდა იყო მაგ: 2, 10.0 და "Hello World!"

# ეს მნიშვნელობები მიეკუთვნებიან განსხვავებულ ტიპებს.

# მაგალითად: 
#           2 არის ინტეჯერ ტიპის მონაცემი int/integer. ინტეჯერი ნიშნავს რიცხვს

#           10.0 არის ფლოათი float მონაცემა ტიპი. ფლოათი ნიშნავს ათწილად რიცხვს

#           "Hello World!" არის სტრინგი str/string მონაცემთა ტიპი. სტრინგი არის ყველა სიტყვა რომელიც არის ბრჭყალებში ""


# თუ არ ხარ დარწმუნებული თუ რა ტიპის მონაცემთან მუშაობ, პითონში გვაქვს ბრძანება სახელად type() რომელიც პირდაპირ ითარგმნება როგორც ტიპი. 

# გამოვიყენებთ ასე

print(type(2))

# და ტერმინალში მივიღებთ ასეთ შედეგს 
# <class 'int'>

# იგივე განმეორდება სხვა მონაცემთა ტიპებზეც

# >>> type(42.0)
# <class 'float'>
# >>> type('Hello, World!')
# <class 'str'>

# ამ შედეგებში სიტყვა "class" გამოიყენება როგორც კატეგორიის მნიშვნელობა.


# როგორც გავიგეთ ინტეჯერები ეკუთვნის ტიპ "int"-ს, სტრინგი ეკუთვნის "str"-ს და ფლოათი "float" -ს



# მაგრამ თუ ნებისმიერი ინტეჯერი არის "2" ბრჭყალებში მოთავსებული, ეს პითონის მიერ რიცხვად აღარ აღიქმება და არის სტრინგ ტიპის მონაცემი. იგივე ხდება ფლოათ მონაცემთა ტიპზეც.

# შევამოწმოთ

print(type("2"))

# ამის შედეგი იქნება - <class 'str'>

# იგივე ფლოათზეც -

# print(type('42.0'))
# <class 'str'>