#                          Formal and natural languages


# ბუნებრივი ენები არის ის ენები, რომლებსაც ადამიანები ლაპარაკობენ, როგორიცაა ინგლისური, ესპანური და ფრანგული. ისინი არ არის შექმნილი კონკრეტული პიროვნების მიერ (თუმცა ადამიანები ცდილობენ გარკვეული წესრიგი მოახდინონ მათში); ისინი ბუნებრივად განვითარდნენ.


# ფორმალური ენა კი არის ის ენა რომელიც შექმნა კონკრეტულმა ხალხმა რომ შეასრულოს კონკრეტული მიზანი. მაგალითად მათემატიკოსები იყენებენ ფორმალურ ენას, რიცხვებით და სიმბოლოებით. ქიმიკოსებიც იყენებენ ფორმალურ ენას რადგან მოლეკულების ქიმიური სტრუქტურა წარმოაჩინონ.

# და ყველაზე მნიშვნელოვანი: პროგრამირების ენები არის ფორმალური ენები რომლების შეიქმნა კომპუტაციური ოპერაციების შესრულებისთვის.

# computation

# კომპიუტაციური ნიშნავს ყველაფერს, რაც დაკავშირებულია კომპიუტერებთან და მათ მიერ შესრულებულ სამუშაოებთან. კომპიუტაციური ოპერაციები მოიცავს ნებისმიერი სახის გამოთვლებს, ანგარიშებს, ანალიზებს და სხვა ტიპის პროცესებს, რომლებსაც კომპიუტერები ახორციელებენ პროგრამების საშუალებით.



#  ----------------------------------------------------------------

# ფორმალურ ენებს აქვთ მკაცრი სინტაქსი(იგივე მართლწერა) რომელიც განსაზღვრავს თუ როგორ უნდა დაიწეროს გარკვეული წინადადება. მაგალითად, მათემატიკაში 3 + 3 = 6 სწორია, მაგრამ 3 + = 3$6 არ არის სწორი. ქიმიაში h20 სწორია მაგრამ 2Zz არა.

