#                        Glossary


# რა არის გლოსარი - იგივე წიგნების ან დოკუმენტების ბოლოს რომაა წიგნში არსებული უცხო ტერმინების განმარტება



# glossary პროგრამირებაში


# 1. problem solving - პროცესი, რომელიც პრობლემის ფორმულირებას და გადაჭრის გზებს მოიცავს

# 2. high level language - პროგრამირების ენა რომელიც შეიმუშავეს ადამიანებისთვის რომ მარტივი ყოფილიყო, როგორიცაა პითონი.

# 3. low level language - პროგრამირების ენა, რომელიც შეიქმნა იმისთვის რომ კომპიუტერისთვის ყოფილიყო მარტივი. ასეთ ენებს ეწოდებათ "machine language" ან "assembly language"

# 4. portability: ისეთი პროგრამა რომელიც შეგიძლია სხვადასხვა ტიპის კომპიუტერებაე გაუშვა

# 5. interpreter - პროგრამა რომელიც კითხულობს სხვა პროგრამას და მას ასრულებს

# 6. prompt - სიმბოლოები რომლებიც გამოსაახულია ინტერპრეტატორის მიერ რომელიც ანიშნებს რომ მზადაა ინფუთის მისაღებად მომხმარებლისგან.

# 7. program - ინსტრუქციები რომლებიც განსაზღვრავს კომპუტაციას

# 8. print statement - ინსტრუქცია რომელიც იწვევს რომ პითონის ინტერპრეტატორმა გამოიტანოს მნიშვნელობა ეკრანზე

# 9. operator - სპეციალური სიმბოლო რომელიც აღნიშნავს ადვილ კომპუტაციას როგორიცაა დამატება, გამრავლება და ა.შ

# 10. value - ერთ-ერთი ძირითადი მონაცემთა ნაწილი, მაგალითად რიცხვი ან სტრინგი

# 11. type - მნიშვნელობის კატეგორია. მაგალითად სტრინგი ინტეჯერი და ფლოათი

# 12. integer - მთელი რიცხვო

# 13. floating-point - ათწილადი რიცხვი

# 14. string - ყველა სიმბოლო რაც ბრჭყალებშია 

# 15. natural language - ენა რომელიც ბუნებრივად ჩამოყალიბდა

# 16. formal language - ენა რომელიც ხელოვნურად შექმნეს გარკვეული მიზნისთვის, როგორიცაა პროგრამირების ენა.

# 17. token - პროგრამის სინტაქსური სტრუქტურის ერთ-ერთი ძირითადი ელემენტია, რომელიც ბუნებრივ ენაში სიტყვას ჰგავს.


# 18. syntax - მართლწერა. სტრუქტურის წესები რომელიც კოდის წერისას უნდა დაიცვა

# 19. parse - როცა პროგრამას გამოიკვლევ და გაანალიზებ სინტაქსურ სტრუქტურას

# 20. bug - შეცდომა პროგრამაში.

# 21. debbuging - კოდში შეცდომის პოვნის და გამოსწორების პროვესი


