#                               math functions


# პითონში არის math მოდული რომელიც მოიცავს ბევრ მათემატიკურ ფუნქციას

# მოდული არის ფაილი, სადაც თავმოყრილია ურთიერთდაკავშირებული ფუნქციების ნაკრები. ანუ, მოდული არის ერთი დიდი “კონტეინერი”, რომელშიც შენახულია კონკრეტული თემატიკის კოდები — მაგალითად, მათემატიკური მოქმედებები.

# სანამ მათემატიკურ ფუნქციებს გამოვიყენებთ უნდა დავაიმპორტოთ მათემატიკის მოდული

# import Python-ში ნიშნავს მოდულის შემოტანას შენს პროგრამაში, რათა შეძლო მისი ფუნქციების გამოყენება.

import math

# ეს წინადადება ქმნის მოდულის ობიექტს რომელსაც math ეწოდება. თუ ამ ობიექტს დაბეჭდავ ეკრანზე გამოჩნდება გარკვეული ინფორმაცია ამ მოდეულზე - მაგალითად სად ინახება მისი კოდი ან რომ ნამდვილად მოდულია

print(math)

# <module 'math' (built-in)>
# ეს ნიშნავს, რომ math მოდული ჩაშენებულია Python-ში და უკვე მზად არის გამოსაყენებლად.

# მოდულის ობიექტი შეიცავს იმ ფუნქციებს და ცვლადებს რომელიც ამ მოდულშია აღწერილი, რომ მივწვდეთ ერთერთ ფუნქციას, ჩვენ უნდა დავწეროთ მოდულის სახელი, dot notation, და ფუნქციის სახელი 

# dot notation არის წერტილი მოდულის და ფუნქციის სახელებს შორის

# ratio = signal_power / noise_power

# decibels = 10 * math.log10(ratio)


# output

# >>> radians = 0.7
# >>> height = math.sin(radians)


# პირველი მაგალითი იყენებს math.log10 ეს აღნიშნავს ათწილადოვან ლოგარითმს. (log ბაზა 10-ზე) 
# 

# მეორე მაგალითი პოულობს რადიანში მოცემული კუთხის სინუსის გამოსათვლელად. ცვლადის სახელი radians მიგვანიშნებს იმაზე რომ sin და სხვა ტრიგონომეტრიული ფუნქციები (cos, tan და სხვ.) იღებენ მნიშვნელობებს რადიანებში და არა გრადუსში.

# თუ გვინდა რომ გრადუსები რადიანებში გადავიანოთ, უნდა გავყოთ 180 და გავამრავლოთ pi-ზე

degrees = 45
radians = degrees / 180.0 * math.pi
math.sin(radians)

# 0.707106781187

# math.pi იღებს ცვლად pi-ს math module - ისგან. მისი მნიშვნელობა არის ფლოათი და 15 ციფრია სულ 



# print(math.sqrt(16)) # კვადრატული ფესვი
# print(math.pow(2, 3)) # ხარისხი (გადაეცემა 2 პარამეტრი)
# print(math.floor(3.7)) # დაბლა დამრგვალება
# print(math.ceil(3.1)) # მაღლა დამრგვალება
# print(math.pi) # პი
# print(math.e) #ეილერი
# print(math.log(10)) # ლოგარითმი e-ს ბაზაზე
# print(math.log10(1000)) # ლოგარითმი 10-ის ბაზაზე
# print(math.sin(math.pi / 2)) # სინუსი
# print(math.radians(190)) #რადიანები
# print(math.degrees(math.pi)) #კუთხეების გადაყვანა
#---------------
# radius = 5
# area = math.pi * math.pow(radius, 2)
# print(area)