#                           functions 


# ფუნქცია პროგრამაში არის კოდის ნაწილი, რომელსაც აქვს სახელი და კონკრეტული ბრძანების შესრულება შეუძლია 

# ფუნქციის გამოძახების მაგალითი ჩვენ უკვე ვნახეთ 

# >>> type(42)
# <class 'int'>

# ამ ფუნქციის სახელი არის type. ფრჩხილებში გადაცემულ მნიშვნელობას ფუნქციის არგუმენტი ეწოდება.

# ხშირად ამბობენ რომ ფუნქცია "იღებს" არგუმენტს და "აბრუნებს" შედეგს. ამ შედეგს ეწოდება return value

# პითონს ასევე აქვს ფუნქციები რომლებიც ერთ მონაცემთა ტიპს მეორე მონაცემთა ტიპად გარდაქმნის. მაგალითად, int ფუნქცია გარდაქმნის მნიშვნელობას ინტეჯერად - თუ შეუძლია, სხვა შემთხვევაში ერორს გვიჩვენებს.

# >>> int('32')
# 32
# # >>> int('Hello')
# ValueError: invalid literal for int(): Hello

# int ფუნქციას შეუძლია რომ ფლოათი გადააქციოს ინტეჯერად, ოღონდ ამ შემთხვევაში ინტეჯერი არ მრგვალდება მას უბრალოდ წერტილის შემდეგი ნაწილი ჩამოეჭრება.


# >>> int(3.99999)
# 3
# >>> int(-2.3)
# -2


# float() აქცევს ინტეჯერს და სტრინგს ფლოათად

# >>> float(32)
# 32.0
# >>> float('3.14159')
# 3.14159

# და ბოლოს str() ფუნქცია აქცევს ჩვენს არგუმენტს სტრინგად.

# >>> str(32)
# '32'
# >>> str(3.14159)
# '3.14159'